; domain
(define (domain p01_net1_b6_g2_rt0_instance-domain)
 (:requirements :strips :typing)
 (:types pipe area product batch_atom tank_slot)
 (:predicates (connect ?from - area ?to - area ?pipe - pipe) (unitary ?pipe - pipe) (not_unitary ?pipe - pipe) (last ?batch_atom - batch_atom ?pipe - pipe) (first ?batch_atom - batch_atom ?pipe - pipe) (follow ?next - batch_atom ?previous - batch_atom) (is_product ?batch_atom - batch_atom ?product - product) (on ?batch_atom - batch_atom ?area - area) (may_interface ?product_a - product ?product_b - product) (normal ?pipe - pipe) (push_updating ?pipe - pipe) (pop_updating ?pipe - pipe) (tank_slot_product_location ?tank_slot - tank_slot ?product - product ?area - area) (occupied ?tank_slot - tank_slot) (not_occupied ?tank_slot - tank_slot))
 (:action push_start
  :parameters ( ?pipe - pipe ?batch_atom_in - batch_atom ?from_area - area ?to_area - area ?first_batch_atom - batch_atom ?product_batch_atom_in - product ?product_first_batch - product ?tank_slot - tank_slot)
  :precondition (and (normal ?pipe) (not_unitary ?pipe) (connect ?from_area ?to_area ?pipe) (first ?first_batch_atom ?pipe) (on ?batch_atom_in ?from_area) (is_product ?batch_atom_in ?product_batch_atom_in) (is_product ?first_batch_atom ?product_first_batch) (may_interface ?product_batch_atom_in ?product_first_batch) (tank_slot_product_location ?tank_slot ?product_batch_atom_in ?from_area) (occupied ?tank_slot))
  :effect (and (push_updating ?pipe) (not (normal ?pipe)) (first ?batch_atom_in ?pipe) (not (first ?first_batch_atom ?pipe)) (follow ?first_batch_atom ?batch_atom_in) (not (on ?batch_atom_in ?from_area)) (not (occupied ?tank_slot)) (not_occupied ?tank_slot)))
 (:action push_end
  :parameters ( ?pipe - pipe ?from_area - area ?to_area - area ?last_batch_atom - batch_atom ?next_last_batch_atom - batch_atom ?product_last_batch - product ?tank_slot - tank_slot)
  :precondition (and (push_updating ?pipe) (not_unitary ?pipe) (connect ?from_area ?to_area ?pipe) (last ?last_batch_atom ?pipe) (follow ?last_batch_atom ?next_last_batch_atom) (is_product ?last_batch_atom ?product_last_batch) (tank_slot_product_location ?tank_slot ?product_last_batch ?to_area) (not_occupied ?tank_slot))
  :effect (and (not (push_updating ?pipe)) (normal ?pipe) (not (follow ?last_batch_atom ?next_last_batch_atom)) (last ?next_last_batch_atom ?pipe) (not (last ?last_batch_atom ?pipe)) (on ?last_batch_atom ?to_area) (occupied ?tank_slot) (not (not_occupied ?tank_slot))))
 (:action pop_start
  :parameters ( ?pipe - pipe ?batch_atom_in - batch_atom ?from_area - area ?to_area - area ?last_batch_atom - batch_atom ?product_batch_atom_in - product ?product_last_batch - product ?tank_slot - tank_slot)
  :precondition (and (normal ?pipe) (not_unitary ?pipe) (connect ?from_area ?to_area ?pipe) (last ?last_batch_atom ?pipe) (on ?batch_atom_in ?to_area) (is_product ?batch_atom_in ?product_batch_atom_in) (is_product ?last_batch_atom ?product_last_batch) (may_interface ?product_batch_atom_in ?product_last_batch) (tank_slot_product_location ?tank_slot ?product_batch_atom_in ?to_area) (occupied ?tank_slot))
  :effect (and (pop_updating ?pipe) (not (normal ?pipe)) (last ?batch_atom_in ?pipe) (not (last ?last_batch_atom ?pipe)) (follow ?batch_atom_in ?last_batch_atom) (not (on ?batch_atom_in ?to_area)) (not (occupied ?tank_slot)) (not_occupied ?tank_slot)))
 (:action pop_end
  :parameters ( ?pipe - pipe ?from_area - area ?to_area - area ?first_batch_atom - batch_atom ?next_first_batch_atom - batch_atom ?product_first_batch - product ?tank_slot - tank_slot)
  :precondition (and (pop_updating ?pipe) (not_unitary ?pipe) (connect ?from_area ?to_area ?pipe) (first ?first_batch_atom ?pipe) (follow ?next_first_batch_atom ?first_batch_atom) (tank_slot_product_location ?tank_slot ?product_first_batch ?from_area) (not_occupied ?tank_slot))
  :effect (and (not (pop_updating ?pipe)) (normal ?pipe) (not (follow ?next_first_batch_atom ?first_batch_atom)) (first ?next_first_batch_atom ?pipe) (not (first ?first_batch_atom ?pipe)) (on ?first_batch_atom ?from_area) (occupied ?tank_slot) (not (not_occupied ?tank_slot))))
 (:action push_unitarypipe
  :parameters ( ?pipe - pipe ?batch_atom_in - batch_atom ?from_area - area ?to_area - area ?first_batch_atom - batch_atom ?product_batch_atom_in - product ?product_first_batch - product ?from_tank_slot - tank_slot ?to_tank_slot - tank_slot)
  :precondition (and (first ?first_batch_atom ?pipe) (connect ?from_area ?to_area ?pipe) (on ?batch_atom_in ?from_area) (unitary ?pipe) (is_product ?batch_atom_in ?product_batch_atom_in) (is_product ?first_batch_atom ?product_first_batch) (may_interface ?product_batch_atom_in ?product_first_batch) (tank_slot_product_location ?from_tank_slot ?product_batch_atom_in ?from_area) (occupied ?from_tank_slot) (tank_slot_product_location ?to_tank_slot ?product_first_batch ?to_area) (not_occupied ?to_tank_slot))
  :effect (and (first ?batch_atom_in ?pipe) (not (first ?first_batch_atom ?pipe)) (last ?batch_atom_in ?pipe) (not (last ?first_batch_atom ?pipe)) (not (on ?batch_atom_in ?from_area)) (not (occupied ?from_tank_slot)) (not_occupied ?from_tank_slot) (on ?first_batch_atom ?to_area) (occupied ?to_tank_slot) (not (not_occupied ?to_tank_slot))))
 (:action pop_unitarypipe
  :parameters ( ?pipe - pipe ?batch_atom_in - batch_atom ?from_area - area ?to_area - area ?first_batch_atom - batch_atom ?product_batch_atom_in - product ?product_first_batch - product ?from_tank_slot - tank_slot ?to_tank_slot - tank_slot)
  :precondition (and (first ?first_batch_atom ?pipe) (connect ?from_area ?to_area ?pipe) (on ?batch_atom_in ?to_area) (unitary ?pipe) (is_product ?batch_atom_in ?product_batch_atom_in) (is_product ?first_batch_atom ?product_first_batch) (may_interface ?product_batch_atom_in ?product_first_batch) (tank_slot_product_location ?to_tank_slot ?product_batch_atom_in ?to_area) (occupied ?to_tank_slot) (tank_slot_product_location ?from_tank_slot ?product_first_batch ?from_area) (not_occupied ?from_tank_slot))
  :effect (and (last ?batch_atom_in ?pipe) (not (last ?first_batch_atom ?pipe)) (first ?batch_atom_in ?pipe) (not (first ?first_batch_atom ?pipe)) (not (on ?batch_atom_in ?to_area)) (not (occupied ?to_tank_slot)) (not_occupied ?to_tank_slot) (on ?first_batch_atom ?from_area) (occupied ?from_tank_slot) (not (not_occupied ?from_tank_slot))))
)

; problem
(define (problem p01_net1_b6_g2_rt0_instance-problem)
 (:domain p01_net1_b6_g2_rt0_instance-domain)
 (:objects
   s12 s13 - pipe
   a1 a2 a3 - area
   lco gasoleo rat_a oca1 oc1b - product
   b0 b3 b1 b4 b2 b5 - batch_atom
   ta1_1_lco ta1_1_gasoleo ta1_1_rat_a ta1_1_oca1 ta1_1_oc1b ta2_1_lco ta2_1_gasoleo ta2_1_rat_a ta2_1_oca1 ta2_1_oc1b ta3_1_lco ta3_1_gasoleo ta3_1_rat_a ta3_1_oca1 ta3_1_oc1b - tank_slot
 )
 (:init (normal s12) (normal s13) (may_interface lco lco) (may_interface gasoleo gasoleo) (may_interface rat_a rat_a) (may_interface oca1 oca1) (may_interface oc1b oc1b) (may_interface lco gasoleo) (may_interface gasoleo lco) (may_interface lco oca1) (may_interface oca1 lco) (may_interface lco oc1b) (may_interface oc1b lco) (may_interface lco rat_a) (may_interface rat_a lco) (may_interface gasoleo rat_a) (may_interface rat_a gasoleo) (may_interface gasoleo oca1) (may_interface oca1 gasoleo) (may_interface gasoleo oc1b) (may_interface oc1b gasoleo) (may_interface oca1 oc1b) (may_interface oc1b oca1) (connect a1 a2 s12) (connect a1 a3 s13) (tank_slot_product_location ta1_1_lco lco a1) (tank_slot_product_location ta1_1_gasoleo gasoleo a1) (tank_slot_product_location ta1_1_rat_a rat_a a1) (tank_slot_product_location ta1_1_oca1 oca1 a1) (tank_slot_product_location ta1_1_oc1b oc1b a1) (tank_slot_product_location ta2_1_lco lco a2) (tank_slot_product_location ta2_1_gasoleo gasoleo a2) (tank_slot_product_location ta2_1_rat_a rat_a a2) (tank_slot_product_location ta2_1_oca1 oca1 a2) (tank_slot_product_location ta2_1_oc1b oc1b a2) (tank_slot_product_location ta3_1_lco lco a3) (tank_slot_product_location ta3_1_gasoleo gasoleo a3) (tank_slot_product_location ta3_1_rat_a rat_a a3) (tank_slot_product_location ta3_1_oca1 oca1 a3) (tank_slot_product_location ta3_1_oc1b oc1b a3) (is_product b0 oc1b) (is_product b3 rat_a) (is_product b1 lco) (is_product b4 lco) (is_product b2 gasoleo) (is_product b5 oca1) (on b0 a1) (occupied ta1_1_oc1b) (on b3 a1) (occupied ta1_1_rat_a) (on b1 a3) (occupied ta3_1_lco) (on b2 a1) (occupied ta1_1_gasoleo) (not_occupied ta1_1_lco) (not_occupied ta1_1_oca1) (not_occupied ta2_1_lco) (not_occupied ta2_1_gasoleo) (not_occupied ta2_1_rat_a) (not_occupied ta2_1_oca1) (not_occupied ta2_1_oc1b) (not_occupied ta3_1_gasoleo) (not_occupied ta3_1_rat_a) (not_occupied ta3_1_oca1) (not_occupied ta3_1_oc1b) (first b4 s12) (last b4 s12) (first b5 s13) (last b5 s13) (unitary s12) (unitary s13))
 (:goal (and (on b2 a3) (on b5 a2) (normal s12) (normal s13)))
)

; plan
1. (pop_unitarypipe s13 b1 a1 a3 b5 lco oca1 ta1_1_oca1 ta3_1_lco)
   deleted: (last b5 s13) (first b5 s13) (on b1 a3) (occupied ta3_1_lco) (not_occupied ta1_1_oca1)
   added: (last b1 s13) (first b1 s13) (not_occupied ta3_1_lco) (on b5 a1) (occupied ta1_1_oca1)
   goals met: 2 of 4
2. (push_unitarypipe s13 b2 a1 a3 b1 gasoleo lco ta1_1_gasoleo ta3_1_lco)
   deleted: (first b1 s13) (last b1 s13) (on b2 a1) (occupied ta1_1_gasoleo) (not_occupied ta3_1_lco)
   added: (first b2 s13) (last b2 s13) (not_occupied ta1_1_gasoleo) (on b1 a3) (occupied ta3_1_lco)
   goals met: 2 of 4
3. (push_unitarypipe s13 b3 a1 a3 b2 rat_a gasoleo ta1_1_rat_a ta3_1_gasoleo)
   deleted: (first b2 s13) (last b2 s13) (on b3 a1) (occupied ta1_1_rat_a) (not_occupied ta3_1_gasoleo)
   added: (first b3 s13) (last b3 s13) (not_occupied ta1_1_rat_a) (on b2 a3) (occupied ta3_1_gasoleo)
   goals met: 3 of 4
4. (push_unitarypipe s12 b5 a1 a2 b4 oca1 lco ta1_1_oca1 ta2_1_lco)
   deleted: (first b4 s12) (last b4 s12) (on b5 a1) (occupied ta1_1_oca1) (not_occupied ta2_1_lco)
   added: (first b5 s12) (last b5 s12) (not_occupied ta1_1_oca1) (on b4 a2) (occupied ta2_1_lco)
   goals met: 3 of 4
5. (push_unitarypipe s12 b0 a1 a2 b5 oc1b oca1 ta1_1_oc1b ta2_1_oca1)
   deleted: (first b5 s12) (last b5 s12) (on b0 a1) (occupied ta1_1_oc1b) (not_occupied ta2_1_oca1)
   added: (first b0 s12) (last b0 s12) (not_occupied ta1_1_oc1b) (on b5 a2) (occupied ta2_1_oca1)
   goals met: 4 of 4
